app/Helpers/log_helper.php

INSERT INTO `aktivitas_akun` (`id_aktivitas`, `tanggal`, `waktu`, `nama_akun`, `aktivitas`, `keterangan`, `ip_address`, `user_agent`) VALUES ('4bff7fdd-b233-4c9c-8181-71284b3be5e6', '2025-07-08', '11:52:46', 'superadmin', 'Login', 'Berhasil login ke sistem', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36')
---
        function catat_aktivitas($nama_akun, $aktivitas, $keterangan = '')
        {
            $model = new \App\Models\AktivitasAkunModel();

            $ip = $_SERVER['REMOTE_ADDR'] ?? '0.0.0.0';
            if ($ip === '::1') $ip = '127.0.0.1';

            $data = [
                'id_aktivitas' => \Ramsey\Uuid\Uuid::uuid4()->toString(),
                'tanggal'      => date('Y-m-d'),
                'waktu'        => date('H:i:s'),
                'nama_akun'    => $nama_akun,
                'aktivitas'    => $aktivitas,
                'keterangan'   => $keterangan,
                'ip_address'   => $ip,
                'user_agent'   => $_SERVER['HTTP_USER_AGENT'] ?? '-'
            ];

            $model->insert($data);