app/Controllers/Akun.php

        public function aktivitas_akun()
        {
            if (!session()->get('is_logged_in')) {
                return redirect()->to('/login');
            }

            $model = new AktivitasAkunModel();
            $aktivitas_akun = $model->paginate(10, 'aktivitas_akun');
---
SELECT *
FROM `aktivitas_akun`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `aktivitas_akun`