app/Controllers/Login.php

        public function proses()
        {
            date_default_timezone_set("Asia/Jakarta");
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $user = $userModel->where('username', $username)->first();

            if ($user && password_verify($password, $user['password'])) {
                // Login berhasil → simpan sesi
                session()->set([
                    'user_id'       => $user['id_user'],
                    'nama_lengkap'  => $user['nama_lengkap'],
                    'username'      => $user['username'],
                    'role'          => $user['role'],
                    'is_logged_in'  => true
                ]);

                // ✅ Update last_active di database
                $db = \Config\Database::connect();
                $db->table('users_login')
                ->where('id_user', $user['id_user'])
                ->update(['last_active' => date('Y-m-d H:i:s')]);
---
UPDATE `users_login` SET `last_active` = '2025-07-08 11:52:46'
WHERE `id_user` = '993a12d2-d7a9-4a00-8daf-6af57dff2bd1'